<img src = "https://drive.google.com/uc?export=view&id=1RQ9YosT6N8bIrbPkehL8hGGY9P1GfHuC" alt = "Encabezado MLDS" width = "100%">  </img>

# **Conceptos de SQL con _Python_**
---

En este notebook se dará una breve introducción práctica a las librerías para la integración de SQL en el lenguaje de programación _Python_, con el objetivo de repasar conceptos básicos de SQL necesarios para tener un punto de referencia y de partida para abordar las tecnologías NoSQL trabajadas en el módulo.

## **1. Dependencias**
---
Inicialmente, instalamos e importamos las librerías necesarias:

In [2]:
# SQLite3 - Librería estándar de Python
import sqlite3

In [3]:
# Instalamos el módulo SQLALchemy.
!pip install sqlalchemy
import sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\camilo\anaconda3\lib\site-packages (1.3.18)

In [4]:
# Pandas - Librería de análisis y manipulación de datos
import pandas as pd

In [5]:
# Versiones de las librerías usadas.
import platform

print('SQLite (Python):', platform.python_version())
print('SQLAlchemy:', sqlalchemy.__version__)
print('Pandas:', pd.__version__)

SQLite (Python): 3.8.3
SQLAlchemy: 1.3.18
Pandas: 1.0.5

Esta actividad se realizó con las siguientes versiones:
* **SQLite (Python)**: 3.7.10
* **SQLAlchemy**: 1.4.7
* **Pandas**: 1.1.5

## **2. SQLite**
---

[SQLite](https://www.sqlite.org/docs.html) es un motor de base de datos ligero que opera con el sistema de archivos local sin necesidad de un servidor con una integración sencilla con _Python_, basado en el lenguaje de dominio general SQL (del inglés _Structured Query Language_), usado ampliamente en una amplia variedad gestores de bases de datos relacionales, y siendo uno de los pilares fundamentales del almacenamiento tradicional.

Por defecto, _Python_ trae un módulo de la librería estándar llamado **`sqlite3`** que puede ser usado para interactuar con esta base de datos.

In [6]:
# Importamos la librería.
import sqlite3

### **2.1. Conectando la base de datos**
---

Veamos un ejemplo de cómo conectar el cliente de _Python_ con una base de datos en SQLite con ayuda de la función **`connect`**.

In [7]:
connection = sqlite3.connect("my_db.db")

connection

Esta función recibe el primer argumento **`database`**, que puede ser interpretado de varias maneras. En este caso, *SQLite3* genera un archivo en disco en el cual se almacenará el contenido de la base de datos. Procedemos a ver el archivo generado:

In [8]:
# El comando "ls" con la bandera "-l" permite conocer el tamaño de un archivo determinado.
!ls -l my_db.db

"ls" no se reconoce como un comando interno o externo,
programa o archivo por lotes ejecutable.

Como puede notar, el archivo ocupa $0$ bytes en memoria pues aún no dispone de información almacenada. La función **`connect`** también permite el uso de una base de datos temporal, almacenada únicamente en memoria RAM. Para esto, se utiliza la palabra reservada **`":memory:"`**:

In [9]:
connection_mem = sqlite3.connect(":memory:")

connection_mem

Ambos llamados retornan un objeto de tipo **`sqlite3.Connection`** sobre el que se realizan las operaciones en la base de datos.

### **2.2. Ejecutar comandos de SQL**
---

Ahora que tenemos una conexión a la base de datos veremos un ejemplo de cómo ejecutar cualquier comando en **`sqlite3`**. Para ello, vamos a definir un [cursor](https://es.wikipedia.org/wiki/Cursor_(base_de_datos)) con el cual tener el control de la ejecución de una consulta o *query* determinada. Para esto, utilizamos el método **`connection.cursor`** y posteriormente usamos el método **`cursor.execute`** para llevar a cabo la operación.

En este ejemplo vamos a definir la siguiente tabla representando una base de datos con información de estudiantes:

|Variable| Tipo de dato|
|---|---|
|**id** |Número entero (_Integer_)|
|**names (nombres)** | Cadena de texto (_String_) |
|**age (edad)** | Número entero (_Integer_)|
|**gender (género)**| Cadena de texto (_String_) |
|**grade (nota)**| Número real (_Float_) |

_SQLite_ opera a partir del uso de un conjunto reducido de instrucciones del lenguaje de gestión de bases de datos relacionales SQL.

> **Nota:** Esta guía no pretende ser una guía completa al lenguaje SQL ni de funciones avanzadas del subconjunto interpretado por _SQLite_. Para más información de SQL lo invitamos a indagar en la documentación oficial de [SQLite](https://www.sqlite.org/docs.html) y del módulo dedicado de _Python_ [**`sqlite3`**](https://docs.python.org/3/library/sqlite3.html).

#### **2.2.1. Crear una tabla**
---

Para crear una tabla en la base de datos podemos utilizar la instrucción SQL **`CREATE TABLE`**. Además, definiremos que el nombre de nuestra base de datos será **`students`** y que solo se creará si no existe ya en la conexión una base de datos coincidente (**`IF NOT EXISTS`**) para prevenir errores de reescritura. De momento, el inicio de nuestra  instrucción es el siguiente:

```sql
CREATE TABLE IF NOT EXISTS students (
  ...
);
```

> Note el uso de punto y coma **`;`** al final de la instrucción. Es considerado una buena práctica y en ocasiones es requerido para el correcto funcionamiento de un comando.

Finalmente, definimos los campos o variables de la base de datos dentro de los paréntesis, separados por comas. Estos deberían tener la siguiente estructura:

```sql
nombre DATATYPE (... modificadores opcionales)
```

> Es considerado buena práctica definir el nombre de la variable en minúscula y los tipos de dato y modificadores en mayúscula.

En _SQLite_ se consideran los siguientes tipos de dato:

* **`NULL`**: Valor con dato nulo.
* **`INTEGER`**: Valor de un número entero con signo de hasta $8$ bytes. 
* **`REAL`**: Valor con un número real con signo de $8$ bytes. 
* **`TEXT`**: Valor con una cadena de texto. 
* **`BLOB`**: Valor con un objeto de datos binarios como una imagen o video.


Finalmente, al considerar modificadores, definiremos la variable **`id`** como nuestra llave primaria (**`PRIMARY KEY`**) con un comportamiento autoincremental (**`AUTOINCREMENT`**). Al definir este tipo de comportamiento podemos ignorar esta variable al insertar datos y dejar que el motor genere llaves con números enteros que se incrementa automáticamente. Además de esto, definiremos un modificador para que la variable **`names`** sea obligatoria y no se permitan valores nulos (**`NOT NULL`**).


Nuestro comando resultante para la creación de nuestra primera base de datos es:

```sql
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    names TEXT NOT NULL,
    age INTEGER,
    gender TEXT,
    grade FLOAT);
```


En _Python_, podemos definir cadenas de texto con múltiples líneas con la sintaxis de la triple comilla doble (**`"""`**):

In [10]:
# Definimos la instrucción de SQL a ejecutar
command = """
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    names TEXT NOT NULL,
    age INTEGER,
    gender TEXT,
    grade FLOAT
    );
"""

Ahora, tomamos el comando y lo usamos como argumento del método **`execute`** del cursor, y lo consolidamos en la conexión con el método **`commit`**:

In [11]:
# Definimos el cursor
cursor = connection.cursor()

# Ejecutamos el comando en sqlite3
cursor.execute(command)

# Actualizamos los cambios en la conexión
connection.commit()

Veamos información de la tabla creada con el comando **`PRAGMA table_info`**:

> **Nota:** Las [sentencias PRAGMA](https://www.sqlite.org/pragma.html) son un grupo de comandos específicos de _SQLite_ con utilidades generales. En este caso utilizamos la instrucción **`table_info`** para consultar una descripción de los campos de una tabla de la base de datos.

In [12]:
# Creamos un cursor nuevo.
cursor = connection.cursor()
# Ejecutamos la instrucción PRAGMA.
cursor.execute("PRAGMA table_info(students)")
# Este comando permite traer todos los resultados del cursor.
cursor.fetchall()

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'names', 'TEXT', 1, None, 0),
 (2, 'age', 'INTEGER', 0, None, 0),
 (3, 'gender', 'TEXT', 0, None, 0),
 (4, 'grade', 'FLOAT', 0, None, 0)]

Un cursor tiene una vida útil limitada a una única consulta. Si quisiéramos obtener el resultado anterior deberíamos almacenarlo en una variable pues el cursor ya no tiene más datos disponibles para la consulta:

In [13]:
# Si aplicamos nuevamente la instrucción 'fetchall' obtenemos un resultado vacío.
cursor.fetchall()

[]

Ahora, vamos a definir una segunda tabla relacionada a la tabla de estudiantes, con información de sus padres/acudientes. Esta tendrá las siguientes variables:

|Variable| Tipo de dato|
|---|---|
|**id** |Número entero (_Integer_)|
|**names (nombres)** | Cadena de texto (_String_) |
|**age (edad)** | Número entero (_Integer_)|
|**gender (género)**| Cadena de texto (_String_) |
|**student_id (id del estudiante)**| Número real (_Float_) |

Este último campo referencia al ID de un registro de la tabla **`students`**. Para esto, podemos definirla como una llave foránea con el comando **`FOREIGN KEY`** de la siguiente forma:

```sql
CREATE TABLE IF NOT EXISTS parents (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    names TEXT NOT NULL,
    age INTEGER,
    gender TEXT,
    student_id INTEGER NOT NULL,
    FOREIGN KEY (student_id) REFERENCES students (id));
```

Note que se declara la variable con su tipo de dato correspondiente y además se realiza la referencia de esta a la variable **`id`** de la otra tabla **`students`**. Continuemos con la creación de la nueva tabla:

In [14]:
# Definimos el cursor.
cursor = connection.cursor()

# Definimos la instrucción de SQL a ejecutar.
command = """
CREATE TABLE IF NOT EXISTS parents (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    names TEXT NOT NULL,
    age INTEGER,
    gender TEXT,
    student_id INTEGER NOT NULL,
    FOREIGN KEY (student_id) REFERENCES students (id)
    );
"""
# Ejecutamos el comando en sqlite3.
cursor.execute(command)

# Actualizamos los cambios en la conexión.
connection.commit()

Veamos información de la tabla creada:

In [15]:
cursor = connection.cursor()
cursor.execute("PRAGMA table_info(parents)")
cursor.fetchall()

[(0, 'id', 'INTEGER', 0, None, 1),
 (1, 'names', 'TEXT', 1, None, 0),
 (2, 'age', 'INTEGER', 0, None, 0),
 (3, 'gender', 'TEXT', 0, None, 0),
 (4, 'student_id', 'INTEGER', 1, None, 0)]

#### **2.2.2. Insertar datos a la tabla**
---

Ahora, vamos a insertar valores en las tablas que acabamos de crear. Para esto, usamos la instrucción **`INSERT INTO`** en la cual definiremos inicialmente la tabla y los campos que deseamos ingresar. El comando empieza entonces de la siguiente forma:

```sql
INSERT INTO
    students (names, age, gender, grade)
...
```

Luego de definir los campos a modificar podemos definir los nuevos campos a ingresar con la siguiente parte de la instrucción llamada **`VALUES`**. Después de ella se ingresan los registros a ingresar separados por comas y encerrados en paréntesis como las tuplas de _Python_. El resultado final del comando es el siguiente:

```sql
INSERT INTO
    students (names, age, gender, grade)
VALUES
    ('Bart Simpson', 10, 'male', 3.0),
    ('Lisa Simpson', 8, 'female', 4.9),
    ('Milhouse Van Houten', 11, 'male', 2.8);
```

Para ejecutar el comando utilizamos la secuencia **`execute`** y **`commit`**, tal como antes:

In [16]:
# Definimos la instrucción de SQL a ejecutar
command = """
INSERT INTO
    students (names, age, gender, grade)
VALUES
    ('Bart Simpson', 10, 'male', 3.0),
    ('Lisa Simpson', 8, 'female', 4.9),
    ('Milhouse Van Houten', 11, 'male', 2.8);
"""

# Definimos el cursor, ejecutamos y consolidamos la instrucción.
cursor = connection.cursor()
cursor.execute(command)
connection.commit()

Ahora, agreguemos valores a la tabla de los padres:

In [17]:
# Definimos la instrucción de SQL a ejecutar
command = """
INSERT INTO
    parents (names, age, gender, student_id)
VALUES
    ('Homero Simpson', 39, 'male', 1),
    ('Marge Simpson', 33, 'female', 1),
    ('Homero Simpson', 39, 'male', 2),
    ('Marge Simpson', 33, 'female', 2),
    ('Kirk Van Houten', 40, 'male', 3),
    ('Luann Van Houten', 32, 'female', 3);
"""

# Definimos el cursor, ejecutamos y consolidamos la instrucción.
cursor = connection.cursor()
cursor.execute(command)
connection.commit()

#### **2.2.3. Consultar campos de una tabla**
---

Para consultar los datos almacenados en una tabla podemos utilizar la instrucción **`SELECT`**. Esta tiene la siguiente estructura:

```sql
SELECT var_1, var_2, ... FROM tabla
```

De esta forma se obtienen únicamente los campos señalados de todos los registros coincidentes. Veamos los valores en la tabla de estudiantes usando la función **`fetchall`** del objeto cursor:

In [18]:
# Definimos el cursor.
cursor = connection.cursor()

# Definimos la instrucción de SQL a ejecutar.
command = """
SELECT names, gender FROM students;
"""
cursor.execute(command)
cursor.fetchall()

[('Bart Simpson', 'male'),
 ('Lisa Simpson', 'female'),
 ('Milhouse Van Houten', 'male')]

Si se desea obtener todos los campos de una tabla, se puede simplificar con el uso del símbolo **`*`** en la posición en la que se declaran las variables. Veamos todos los campos de los registros de la tabla de padres:

In [19]:
# Definimos el cursor
cursor = connection.cursor()
# Definimos la instrucción de SQL a ejecutar
command = """
SELECT * FROM parents;
"""
cursor.execute(command)
cursor.fetchall()

[(1, 'Homero Simpson', 39, 'male', 1),
 (2, 'Marge Simpson', 33, 'female', 1),
 (3, 'Homero Simpson', 39, 'male', 2),
 (4, 'Marge Simpson', 33, 'female', 2),
 (5, 'Kirk Van Houten', 40, 'male', 3),
 (6, 'Luann Van Houten', 32, 'female', 3)]

Esta instrucción se puede complementar con el uso de la sentencia condicional **`WHERE`**. Con esta se puede definir una condición, con sintaxis similar a la usada por _Python_ y otros lenguajes de programación, que debe cumplir un registro para ser retornado en la consulta. Una operación de consulta condicional tendría la siguiente estructura:

```sql
SELECT variables FROM tabla WHERE condición
```

Realicemos una consulta condicional de los padres de un estudiante específico (con **`id = 1`**):

In [20]:
# Definimos el cursor.
cursor = connection.cursor()

# Definimos la instrucción de SQL a ejecutar.
command = """
SELECT * FROM parents WHERE student_id = 1;
"""
cursor.execute(command)
cursor.fetchall()

[(1, 'Homero Simpson', 39, 'male', 1), (2, 'Marge Simpson', 33, 'female', 1)]

#### **2.2.4. Actualizar un campo de la tabla**
---

Por otro lado, si se desea actualizar uno de los campos de un registro existente de la tabla se puede utilizar la instrucción **`UPDATE`**. Esta tiene una sintaxis similar a la operación **`SELECT`** y se define de la siguiente forma:

```sql
UPDATE tabla SET variable = nuevo_valor
```
Veamos un ejemplo de cómo actualizar la nota de todos los estudiantes de nuestra tabla. Note que se puede utilizar el valor previo y realizar operaciones numéricas sobre el mismo para obtener el nuevo valor.

In [21]:
# Definimos el cursor
cursor = connection.cursor()
# Definimos la instrucción de SQL a ejecutar
command = "UPDATE students SET grade = grade + 0.1"
cursor.execute(command)
connection.commit()

Para tener un mayor control sobre la operación podemos realizar una actualización condicional con la sentencia **`WHERE`** de la misma forma que antes:

In [22]:
# Definimos el cursor
cursor = connection.cursor()
# Definimos la instrucción de SQL a ejecutar
command = """
UPDATE 
    students
SET
    grade = grade - 1
WHERE 
    id = 1
"""
cursor.execute(command)
connection.commit()

Veamos la tabla actualizada:

In [23]:
# Definimos la instrucción de SQL a ejecutar
command = "SELECT * FROM students;"

cursor = connection.cursor()
cursor.execute(command)
cursor.fetchall()

[(1, 'Bart Simpson', 10, 'male', 2.1),
 (2, 'Lisa Simpson', 8, 'female', 5.0),
 (3, 'Milhouse Van Houten', 11, 'male', 2.9)]

#### **2.2.5. Eliminar registros de la tabla**
---
Finalmente, si se desea eliminar un registro específico de la base de datos se puede realizar una operación **`DELETE`**. Esta tiene la siguiente sintaxis, similar a las discutidas previamente:

```sql
DELETE FROM tabla WHERE variable = valor
```

> **Nota:** Tenga cuidado, si se omite la sentencia **`WHERE`** se eliminarían todos los registros de la tabla.

In [24]:
# Definimos la instrucción de SQL a ejecutar
command = "DELETE FROM parents WHERE student_id = 2;"

cursor = connection.cursor()
cursor.execute(command)
connection.commit()

Veamos el cambio en la tabla:

In [25]:
# Definimos la instrucción de SQL a ejecutar
command = "SELECT * FROM parents;"

cursor = connection.cursor()
cursor.execute(command)
cursor.fetchall()

[(1, 'Homero Simpson', 39, 'male', 1),
 (2, 'Marge Simpson', 33, 'female', 1),
 (5, 'Kirk Van Houten', 40, 'male', 3),
 (6, 'Luann Van Houten', 32, 'female', 3)]

Luego de terminar de manipular la base de datos, es importante cerrar la conexión con la instrucción **`close`**.

In [26]:
connection.close()

### **2.3. Interacción con _Pandas_**
---

Por último, veamos un ejemplo de cómo cargar bases de datos de SQLite3 con _Pandas_. Para esto, vamos a crear una nueva conexión a la base de datos almacenada en el archivo **`'my_db.db'`** definido al inicio de la conexión. Esto recuperará todos los datos. También, observe que el tamaño del archivo ya no es de $0$ bytes.

In [26]:
!ls -l my_db.db

-rw-r--r-- 1 root root 16384 Nov 11 14:09 my_db.db

In [27]:
connection = sqlite3.connect("my_db.db")

_Pandas_ dispone de un método de carga directa de orígenes SQL con la función **`read_sql`**. Esta permite realizar consultas como se ha hecho hasta ahora con una conexión de motores de bases de datos. Utilizaremos nuestra conexión a SQLite para el siguiente ejemplo, con una consulta total (**`SELECT *`**) de los registros de la tabla **`students`**.

In [28]:
import pandas as pd
pd.__version__

'1.0.5'

> Este material fue creado con la versión **`1.1.5`** de _Pandas_.

In [29]:
df = pd.read_sql("SELECT * FROM students", connection, index_col="id")
df

                  names  age  gender  grade
id
1          Bart Simpson   10    male    2.1
2          Lisa Simpson    8  female    5.0
3   Milhouse Van Houten   11    male    2.9

Y para la tabla de padres:

In [30]:
pd.read_sql("SELECT id, age, names, gender FROM parents", connection, index_col="id")

    age             names  gender
id
1    39    Homero Simpson    male
2    33     Marge Simpson  female
5    40   Kirk Van Houten    male
6    32  Luann Van Houten  female

In [31]:
# Cerramos la conexión.
connection.close()

## **3. SQLAlchemy**
---

[SQLAlchemy](https://www.sqlalchemy.org/) es un toolkit para _Python_ que permite toda la flexibilidad de SQL con conceptos de programación orientada a objetos. En esta sección vamos a mostrar el manejo de esta librería para la creación y el manejo de bases de datos.

Primero, instalaremos e importaremos la librería:

In [47]:
# Importamos la librería.
import sqlalchemy

### **3.1. Creación de una sesión para la base de datos**
---

SQLAlchemy permite generar conexiones en bases de datos como PostgreSQL, MySQL, Oracle, Microsoft SQL Server, entre [otros](https://docs.sqlalchemy.org/en/14/dialects/index.html).

En esta ocasión aprovecharemos las ventajas de _SQLite_ para la elaboración de los siguientes ejemplos. Para esto, vamos a definir una base de datos en memoria volátil con _SQLite_, configurando y generando el motor correspondiente con la función **`create_engine`**:

In [48]:
engine = sqlalchemy.create_engine('sqlite:///:memory:', echo=True)

En este caso el atributo **`echo`** habilita el uso de la librería **`logging`** de _Python_. Cuando su valor es **`True`** podremos ver todas las salidas generadas por SQL.

In [49]:
engine

Engine(sqlite:///:memory:)

La variable **`engine`** es un objeto de tipo **`Engine`**, el cual representa la interfaz entre _Python_ y la base de datos.

En este caso creamos una base de datos en SQLite, pero podríamos hacerlo para MySQL u otro servicio. Por ejemplo:

```python
engine = create_engine("mysql://juan:juan_db@localhost/test", isolation_level="READ UNCOMMITTED")
```

### **3.2. Crear tablas**
---

En SQL los datos se organizan en forma de tablas, las cuales se describen por medio de sus columnas. En SQLAlchemy, este comportamiento se maneja por medio de objetos como **`Table`**, **`Column`**, entre otros. Veamos un ejemplo:

In [50]:
from sqlalchemy import MetaData, Table, Column, Integer, String, Float, ForeignKey

Vamos a definir la misma tabla de estudiantes que utilizamos en los ejemplos anteriores para realizar una comparación directa de ambos métodos. En _SQLAlchemy_ se realiza la especificación en sintaxis de _Python_ en forma de argumentos y llamados a funciones.

In [51]:
metadata = sqlalchemy.MetaData()
students = sqlalchemy.Table("students", # Nombre de la tabla.
                            metadata,   # Metadatos. Objeto con la estructura y detalles de la tabla.
                            # Campos de la tabla, usando los modificadores como argumentos.
                            Column('id', Integer, primary_key=True, autoincrement=True),
                            Column('name', String, nullable=False),
                            Column('age', Integer),
                            Column('gender', String),
                            Column('grade', Float))

students

Table('students', MetaData(bind=None), Column('id', Integer(), table=<students>, primary_key=True, nullable=False), Column('name', String(), table=<students>, nullable=False), Column('age', Integer(), table=<students>), Column('gender', String(), table=<students>), Column('grade', Float(), table=<students>), schema=None)

Para crear la tabla, interactuamos con el objeto _engine_ usando el método **`create_all`** del objeto **`MetaData`**:

In [52]:
metadata.create_all(engine)

2021-11-12 20:32:51,320 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2021-11-12 20:32:51,321 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:32:51,321 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2021-11-12 20:32:51,322 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:32:51,323 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("students")
2021-11-12 20:32:51,323 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:32:51,324 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("students")
2021-11-12 20:32:51,325 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:32:51,326 INFO sqlalchemy.engine.base.Engine
CREATE TABLE students (
	id INTEGER NOT NULL,
	name VARCHAR NOT NULL,
	age INTEGER,
	gender VARCHAR,
	grade FLOAT,
	PRIMARY KEY (id)
)


2021-11-12 20:32:51,327 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:32:51,327 INFO sqlalchemy.engine.base.Engine COMMIT

Tras realizar esta secuencia de llamados a funciones, tenemos a nuestra disposición la posibilidad de realizar operaciones a partir del objeto **`students`**.

### **3.3. Insertar valores a una tabla**
---

Para insertar campos, utilizamos un objeto de tipo **`Insert`**, generado con el método **`insert`** de nuestra tabla y que equivale a una instrucción **`INSERT`** de SQL:

In [53]:
ins_command = students.insert().values(name='Bart Simpson',  # Los campos son definidos
                                       age=10,               # como argumentos de la función         
                                       gender="male",        # values del objeto Insert.
                                       grade=3.0)
ins_command

Para ejecutar un comando, tenemos que interactuar con el motor y crear una conexión:

In [54]:
connection = engine.connect()
connection

Finalmente, utilizamos el método **`execute`** de nuestra conexión para ejecutar la inserción:

In [55]:
res = connection.execute(ins_command)

2021-11-12 20:32:52,880 INFO sqlalchemy.engine.base.Engine INSERT INTO students (name, age, gender, grade) VALUES (?, ?, ?, ?)
2021-11-12 20:32:52,881 INFO sqlalchemy.engine.base.Engine ('Bart Simpson', 10, 'male', 3.0)
2021-11-12 20:32:52,881 INFO sqlalchemy.engine.base.Engine COMMIT

Como puede notar en el registro de las operaciones realizadas por SQLAlchemy, realizar este proceso equivale a utilizar una instrucción **`INSERT INTO`**, tal como se describió en el uso de **`SQLite`**.

Si quisiéramos ingresar múltiples valores al tiempo podemos declarar un objeto **`Insert`** vacío e indicar en el llamado del método **`execute`** la lista de valores en forma de diccionarios, donde las llaves corresponden al nombre del campo de la tabla:

In [56]:
ins_command = students.insert()
connection.execute(ins_command, [{"name": "Lisa Simpson", 
                                  "age": 8, 
                                  "gender": "female", 
                                  "grade": 4.9},
                                 {"name": "Milhouse Van Houten", 
                                  "age": 11, 
                                  "gender": "male", 
                                  "grade": 2.8}
                                 ])

2021-11-12 20:32:53,491 INFO sqlalchemy.engine.base.Engine INSERT INTO students (name, age, gender, grade) VALUES (?, ?, ?, ?)
2021-11-12 20:32:53,492 INFO sqlalchemy.engine.base.Engine (('Lisa Simpson', 8, 'female', 4.9), ('Milhouse Van Houten', 11, 'male', 2.8))
2021-11-12 20:32:53,492 INFO sqlalchemy.engine.base.Engine COMMIT

### **3.4. Selección de valores de una tabla**
---
Ahora, veamos el equivalente de la instrucción **`SELECT`**. En esta ocasión, utilizamos la función **`select`** de _SQLAlchemy_ para definir la consulta. Esta función recibe la tabla sobre la que se realiza la consulta y retorna un objeto iterable con el que podemos obtener los valores deseados.

In [57]:
from sqlalchemy.sql import select

In [59]:
select_command = select([students])
result = connection.execute(select_command)

2021-11-12 20:33:48,227 INFO sqlalchemy.engine.base.Engine SELECT students.id, students.name, students.age, students.gender, students.grade
FROM students
2021-11-12 20:33:48,227 INFO sqlalchemy.engine.base.Engine ()

Veamos qué contiene la variable **`result`**:

In [60]:
result

Se trata de un objeto de tipo **`ResultProxy`**. Podemos ver los valores dentro del resultado si lo manejamos como un iterador:

In [61]:
for row in result:
    print(row)

(1, 'Bart Simpson', 10, 'male', 3.0)
(2, 'Lisa Simpson', 8, 'female', 4.9)
(3, 'Milhouse Van Houten', 11, 'male', 2.8)

Podemos manejar el resultado como un generador y obtener uno a uno los registros con la función **`fetch_one`**.

In [67]:
result = connection.execute(select_command)

2021-11-12 20:34:36,883 INFO sqlalchemy.engine.base.Engine SELECT students.id, students.name, students.age, students.gender, students.grade
FROM students
2021-11-12 20:34:36,884 INFO sqlalchemy.engine.base.Engine ()

In [68]:
result.fetchone()

(1, 'Bart Simpson', 10, 'male', 3.0)

Si lo ejecutamos nuevamente obtendremos el valor siguiente. Si queremos conservar el valor anterior debemos almacenarlo en una variable cuando se obtenga.

In [69]:
one_row = result.fetchone()

Aunque se muestre como una tupla, en realidad se trata de un objeto de SQLAlchemy:

In [70]:
type(one_row)

sqlalchemy.engine.result.RowProxy

Si quisiéramos seleccionar algunas columnas en específico, se puede indicar a la función **`select`** una lista de objetos **`Column`**. Podemos acceder a las columnas de una tabla con el atributo **`c`** de la tabla. Este contiene una variable por cada columna declarada en la tabla, y se puede acceder como atributo de la siguiente forma:

In [71]:
students.c.name

Column('name', String(), table=<students>, nullable=False)

Entonces, si se desea obtener únicamente los campos con el nombre y edad de los estudiantes, realizaríamos la siguiente operación:

In [72]:
# Usamos una lista de columnas en vez de una tabla como primer argumento.
select_command = select([students.c.name, students.c.age])

result = connection.execute(select_command)
for row in result:
    print(row)

2021-11-12 20:35:39,410 INFO sqlalchemy.engine.base.Engine SELECT students.name, students.age
FROM students
2021-11-12 20:35:39,410 INFO sqlalchemy.engine.base.Engine ()
('Bart Simpson', 10)
('Lisa Simpson', 8)
('Milhouse Van Houten', 11)

### **3.5. Operadores**
---

Al igual que en SQL, podemos realizar operaciones lógicas y aritméticas. SQLAlchemy se encarga de traducir las operaciones básicas de _Python_ a SQL. Veamos un ejemplo:

In [73]:
students.c.id == students.c.grade

El resultado de realizar operaciones entre columnas es una expresión usada por _SQLAlchemy_ para generar los comandos necesarios. Si imprimimos la operación obtenemos lo siguiente:

In [74]:
print(students.c.id == students.c.id)

students.id = students.id

De esta forma se conserva la sintaxis de SQL en las operaciones. Si usamos un valor específico, como un número, obtenemos lo siguiente:

In [75]:
print(students.c.id == 500)

students.id = :id_1

Esta operación indica que se espera un argumento para el valor específico. 

Para identificar si un valor es nulo, es suficiente con expresar la comparación con **`None`**:

In [76]:
print(students.c.id == None)

students.id IS NULL

Así mismo, es posible usar otros operadores, como se indica a continuación:

In [77]:
# Operaciones lógicas de comparación.
print(students.c.age > 9)

students.age > :age_1

In [78]:
# Operaciones matemáticas entre variables.
print(students.c.grade+students.c.grade)

students.grade + students.grade

In [79]:
# Concatenación de cadenas de texto.
print(students.c.name+students.c.gender)

students.name || students.gender

En caso de que queramos usar un operador que no se encuentre dentro de _SQLAlchemy_ o que no corresponda a una operación válida de _Python_ podemos utilizar el método **`op`** de una columna determinada. Este retorna una función que recibe el valor con el cual se realiza la comparación.

In [80]:
print(students.c.name.op("LIKE")("value"))

students.name LIKE :name_1

Si estamos realizando operaciones lógicas, las podemos unir con conjunciones con las funciones **`and_`**, **`or_`** y **`not_`** de la siguiente forma:

In [81]:
from sqlalchemy.sql import and_, or_, not_

In [82]:
# Equivalente a la expresión lógica:
# (id > 1) and (name != Milhouse...) and ((age < 10) or (grade > 3))

print(and_(students.c.id>1, 
           students.c.name!="Milhouse Van Houten", 
           or_(students.c.age<10, students.c.grade>3.0)))

students.id > :id_1 AND students.name != :name_1 AND (students.age < :age_1 OR students.grade > :grade_1)

Estas expresiones lógicas permiten realizar consultas condicionales con el método **`where`** de un objeto de selección. Veamos un ejemplo sobre como seleccionar algunos valores con una condición:

In [83]:
select_command = select([students.c.name]).where(
    and_(students.c.gender == "male", students.c.age < 11)
)
connection.execute(select_command).fetchall()

2021-11-12 20:38:08,822 INFO sqlalchemy.engine.base.Engine SELECT students.name
FROM students
WHERE students.gender = ? AND students.age < ?
2021-11-12 20:38:08,823 INFO sqlalchemy.engine.base.Engine ('male', 11)

[('Bart Simpson',)]

### **3.6. Actualizar y eliminar valores**
---

Podemos usar otras funciones como **`UPDATE`** y **`DELETE`**. Estas están disponibles como métodos de un objeto **`Table`** y pueden usarse en conjunto con expresiones **`where`**. Para actualizar los valores de un registro, usamos el método **`update`** de nuestra tabla. Luego, en el llamado a la función **`execute`** de la conexión pasamos como argumento en forma de diccionario los valores a actualizar. Esto permite definir de manera flexible los campos específicos que se desean modificar de un registro específico.

In [84]:
# Comando de actualización.
update_command = students.update().where(students.c.name=="Lisa Simpson")
connection.execute(update_command, {"age": 100})

2021-11-12 20:38:39,800 INFO sqlalchemy.engine.base.Engine UPDATE students SET age=? WHERE students.name = ?
2021-11-12 20:38:39,801 INFO sqlalchemy.engine.base.Engine (100, 'Lisa Simpson')
2021-11-12 20:38:39,801 INFO sqlalchemy.engine.base.Engine COMMIT

Veamos el resultado realizando una operación con **`select`**:

In [85]:
connection.execute(select([students])).fetchall()

2021-11-12 20:39:03,967 INFO sqlalchemy.engine.base.Engine SELECT students.id, students.name, students.age, students.gender, students.grade
FROM students
2021-11-12 20:39:03,968 INFO sqlalchemy.engine.base.Engine ()

[(1, 'Bart Simpson', 10, 'male', 3.0),
 (2, 'Lisa Simpson', 100, 'female', 4.9),
 (3, 'Milhouse Van Houten', 11, 'male', 2.8)]

Por su parte, para eliminar valores podemos utilizar el método **`delete`**, que permite también utilizar expresiones **`where`** de la siguiente forma:

In [86]:
connection.execute(students.delete().where(students.c.id == 1))

2021-11-12 20:39:14,927 INFO sqlalchemy.engine.base.Engine DELETE FROM students WHERE students.id = ?
2021-11-12 20:39:14,927 INFO sqlalchemy.engine.base.Engine (1,)
2021-11-12 20:39:14,928 INFO sqlalchemy.engine.base.Engine COMMIT

Finalmente, vemos el resultado de la operación:

In [87]:
connection.execute(select([students])).fetchall()

2021-11-12 20:39:16,507 INFO sqlalchemy.engine.base.Engine SELECT students.id, students.name, students.age, students.gender, students.grade
FROM students
2021-11-12 20:39:16,507 INFO sqlalchemy.engine.base.Engine ()

[(2, 'Lisa Simpson', 100, 'female', 4.9),
 (3, 'Milhouse Van Houten', 11, 'male', 2.8)]

Al igual que con las expresiones **`DELETE`** usadas con _SQLite_, si no se indica una sentencia condicional se eliminan todos los valores de la tabla.

En esta ocasión vamos a vaciar la tabla para los ejemplos posteriores.

In [88]:
# DELETE de toda la tabla.
connection.execute(students.delete())

2021-11-12 20:39:29,064 INFO sqlalchemy.engine.base.Engine DELETE FROM students
2021-11-12 20:39:29,065 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:39:29,065 INFO sqlalchemy.engine.base.Engine COMMIT

In [89]:
# Mostramos el contenido (ahora inexistente) de la tabla.
connection.execute(select([students])).fetchall()

2021-11-12 20:39:48,134 INFO sqlalchemy.engine.base.Engine SELECT students.id, students.name, students.age, students.gender, students.grade
FROM students
2021-11-12 20:39:48,135 INFO sqlalchemy.engine.base.Engine ()

[]

### **3.7. Operación `join` para la combinación de tablas**
---

También podemos unir tablas con usando el comando **`JOIN`**, que son la inspiración de los métodos **`join`** y **`merge`** de los objetos de _Pandas_. 

Antes de mostrar la funcionalidad vamos a crear nuevamente las tablas del primer ejemplo:

In [90]:
# Definimos la primera tabla
metadata = sqlalchemy.MetaData()
students = sqlalchemy.Table("students", metadata,
                            Column('id', Integer, primary_key=True, autoincrement=True),
                            Column('name', String, nullable=False),
                            Column('age', Integer),
                            Column('gender', String),
                            Column('grade', Float))
metadata.create_all(engine)

# Añadimos los valores.
ins_command = students.insert()
connection.execute(ins_command, [{"name": "Bart Simpson", "age": 10, "gender": "male", "grade": 3.0},
                                 {"name": "Lisa Simpson", "age": 8, "gender": "female", "grade": 4.9},
                                 {"name": "Milhouse Van Houten", "age": 11, "gender": "male", "grade": 2.8}])

2021-11-12 20:40:10,957 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("students")
2021-11-12 20:40:10,957 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:40:10,959 INFO sqlalchemy.engine.base.Engine INSERT INTO students (name, age, gender, grade) VALUES (?, ?, ?, ?)
2021-11-12 20:40:10,959 INFO sqlalchemy.engine.base.Engine (('Bart Simpson', 10, 'male', 3.0), ('Lisa Simpson', 8, 'female', 4.9), ('Milhouse Van Houten', 11, 'male', 2.8))
2021-11-12 20:40:10,960 INFO sqlalchemy.engine.base.Engine COMMIT

In [91]:
# Definimos una segunda tabla
parents = sqlalchemy.Table("parents", metadata,
                           Column('id', Integer, primary_key=True, autoincrement=True),
                           Column('name', String, nullable=False),
                           Column('age', Integer),
                           Column('gender', String),
                           Column('student_id', Integer, ForeignKey("students.id")))
metadata.create_all(engine)

# Agregamos valores
ins_command = parents.insert()
connection.execute(ins_command, [{"name": "Homero Simpson", "age": 39, "gender": "male", "student_id": 1},
                                 {"name": "Marge Simpson", "age": 33, "gender": "female", "student_id": 1},
                                 {"name": "Homero Simpson", "age": 39, "gender": "male", "student_id": 2},
                                 {"name": "Marge Simpson", "age": 33, "gender": "female", "student_id": 2},
                                 {"name": "Kirk Van Houten", "age": 40, "gender": "male", "student_id": 3},
                                 {"name": "Luann Van Houten", "age": 32, "gender": "female", "student_id": 3}])

2021-11-12 20:40:12,088 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("students")
2021-11-12 20:40:12,089 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:40:12,090 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("parents")
2021-11-12 20:40:12,091 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:40:12,091 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("parents")
2021-11-12 20:40:12,092 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:40:12,093 INFO sqlalchemy.engine.base.Engine
CREATE TABLE parents (
	id INTEGER NOT NULL,
	name VARCHAR NOT NULL,
	age INTEGER,
	gender VARCHAR,
	student_id INTEGER,
	PRIMARY KEY (id),
	FOREIGN KEY(student_id) REFERENCES students (id)
)


2021-11-12 20:40:12,093 INFO sqlalchemy.engine.base.Engine ()
2021-11-12 20:40:12,094 INFO sqlalchemy.engine.base.Engine COMMIT
2021-11-12 20:40:12,095 INFO sqlalchemy.engine.base.Engine INSERT INTO parents (name, age, gender, student_id) VALUES (?, ?, ?, ?)
2021-11-12 20:40:12,095 INFO sqlalchemy.engine.base.Engine (('Homero Simpson', 39, 'male', 1), ('Marge Simpson', 33, 'female', 1), ('Homero Simpson', 39, 'male', 2), ('Marge Simpson', 33, 'female', 2), ('Kirk Van Houten', 40, 'male', 3), ('Luann Van Houten', 32, 'female', 3))
2021-11-12 20:40:12,096 INFO sqlalchemy.engine.base.Engine COMMIT

La operación **`JOIN`** se suele ubicar después de la expresión **`FROM`** de una instrucción de selección. Por ejemplo, si se quiere realizar la unión unificando los valores de padres e hijos en una única tabla de personas se haría lo siguiente:

```sql
SELECT * FROM students JOIN parents ON students.id = parents.student_id
```
En _SQLAlchemy_ se realiza con el método **`join`** de una tabla (tabla izquierda), pasando como argumento la otra tabla (tabla derecha). Luego, se usa la función **`select_from`** para definir que se desea obtener los valores a partir de esa unión. Veamos un ejemplo:

In [92]:
join_command = students.join(parents, students.c.id == parents.c.student_id)
select_command = select([students.c.name, parents.c.name]).select_from(join_command)

print(select_command)

SELECT students.name, parents.name
FROM students JOIN parents ON students.id = parents.student_id

Veamos el resultado de ejecutar la instrucción con la función **`execute`**:

In [93]:
connection.execute(select_command).fetchall()

2021-11-12 20:42:26,364 INFO sqlalchemy.engine.base.Engine SELECT students.name, parents.name
FROM students JOIN parents ON students.id = parents.student_id
2021-11-12 20:42:26,365 INFO sqlalchemy.engine.base.Engine ()

[('Bart Simpson', 'Homero Simpson'),
 ('Bart Simpson', 'Marge Simpson'),
 ('Lisa Simpson', 'Homero Simpson'),
 ('Lisa Simpson', 'Marge Simpson'),
 ('Milhouse Van Houten', 'Kirk Van Houten'),
 ('Milhouse Van Houten', 'Luann Van Houten')]

### **3.8. Usando expresiones de SQL**
---

Al igual que con librería estándar de _SQLite_, podemos definir una expresión como una cadena de texto y ejecutarla a partir de cursores. Para esto, utilizamos la función **`text`** del módulo **`sqlalchemy.sql`**. Esta genera un comando que puede ser pasado como argumento del método **`execute`** de una conexión. Veamos un ejemplo:

In [94]:
# Obtenemos la concatenación del nombre y género de los estudiantes, separados por comas.
# Además, indicamos que la id va a corresponder a una variable dada.
command_text = """
SELECT
    students.name || ', ' || students.gender
FROM
    students
WHERE
    students.id != :val
"""

In [95]:
# Declaramos un comando a partir de la cadena de texto.
command = sqlalchemy.sql.text(command_text)
command

In [96]:
# Ejecutamos el comando e indicamos un valor que corresponda a la variable 'id' como argumento.
connection.execute(command, val=1).fetchall()

2021-11-12 20:43:32,041 INFO sqlalchemy.engine.base.Engine
SELECT
    students.name || ', ' || students.gender
FROM
    students
WHERE
    students.id != ?

2021-11-12 20:43:32,041 INFO sqlalchemy.engine.base.Engine (1,)

[('Lisa Simpson, female',), ('Milhouse Van Houten, male',)]

### **3.9. Almacenar la base de datos en un archivo**
---

Para trabajar con la base de datos desde un archivo, empezamos por crear un _engine_ que haga referencia al archivo que hallamos usado previamente. En este caso, cargaremos el archivo cargado en el primer ejemplo con _SQLite3_. Empezamos creando el nuevo _engine_:

In [97]:
engine = sqlalchemy.create_engine('sqlite:///my_db.db')

Volvemos a generar las tablas usando los argumentos **`autoload`** (para definir que se carga automáticamente) y **`autoload_with`** (para definir el origen de la carga de datos).

In [98]:
metadata = sqlalchemy.MetaData()

# Cargamos las tablas del origen de datos existente. No es necesario definir los campos.
students = sqlalchemy.Table("students", metadata, autoload = True, autoload_with = engine)
parents = sqlalchemy.Table("parents", metadata, autoload = True, autoload_with = engine)

Con esto es suficiente para empezar la conexión y realizar operaciones tal como se describió en este material.

In [99]:
# Realizamos la conexión.
connection = engine.connect()

# Obtenemos todos los registros del primer ejemplo con SQLite3.
connection.execute(select([students])).fetchall()

[(1, 'Bart Simpson', 10, 'male', 2.1),
 (2, 'Lisa Simpson', 8, 'female', 5.0),
 (3, 'Milhouse Van Houten', 11, 'male', 2.9)]

Al igual que con la otra librería, las bases de datos de *SQLAlchemy* son compatibles con _Pandas_ con el método **`read_sql_table`**, usando como argumento la conexión respectiva:

In [100]:
pd.read_sql_table("students", connection, index_col="id")

                  names  age  gender  grade
id
1          Bart Simpson   10    male    2.1
2          Lisa Simpson    8  female    5.0
3   Milhouse Van Houten   11    male    2.9

Recuerde cerrar las conexiones abiertas al finalizar sus consultas. De lo contrario se pueden generar problemas de sincronización y/o ejecución de los procesos.

In [101]:
# Cerramos la conexión.
connection.close()

## **Recursos adicionales**
---

* [SQLite Documentation](https://www.sqlite.org/docs.html)
* [sqlite3 — DB-API 2.0 interface for SQLite databases](https://docs.python.org/3/library/sqlite3.html)
* [SQLAlchemy - SQL Expression Language Tutorial (1.4 API)](https://docs.sqlalchemy.org/en/14/core/tutorial.html)
* [Khan Academy - Introducción a SQL: consulta y gestión de datos](https://es.khanacademy.org/computing/computer-programming/sql)
* [Kaggle - Intro to SQL](https://www.kaggle.com/learn/intro-to-sql)
* [Kaggle - Advanced SQL](https://www.kaggle.com/learn/advanced-sql)
* [Coursera - Introduction to Structured Query Language (SQL) - University of Michigan](https://www.coursera.org/learn/intro-sql)
* [Udacity - Learn SQL Nanodegree Program](https://www.udacity.com/course/learn-sql--nd072)

## **Créditos**
---

* **Profesor:** [Jorge E. Camargo, PhD](https://dis.unal.edu.co/~jecamargom/)
* **Asistentes docentes:**
  - Juan Sebastián Lara Ramírez
  - Alberto Nicolai Romero Martínez  

**Universidad Nacional de Colombia** - *Facultad de Ingeniería*